#### Terraform Plan Changes detected

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_repository_permissions.repos["example-repo"] will be created
  + resource "github_actions_repository_permissions" "repos" {
      + allowed_actions      = "all"
      + enabled              = true
      + id                   = (known after apply)
      + repository           = "example-repo"
      + sha_pinning_required = (known after apply)
    }

  # github_actions_variable.copilot_firewall_allowlist["example-repo"] will be created
  + resource "github_actions_variable" "copilot_firewall_allowlist" {
      + created_at    = (known after apply)
      + id            = (known after apply)
      + repository    = "example-repo"
      + repository_id = (known after apply)
      + updated_at    = (known after apply)
      + value         = "registry.terraform.io,checkpoint-api.hashicorp.com,api0.prismacloud.io"
      + variable_name = "COPILOT_AGENT_FIREWALL_ALLOW_LIST_ADDITIONS"
    }

  # github_repository.alz_workload_template will be updated in-place
  # (imported from "alz-workload-template")
  ~ resource "github_repository" "alz_workload_template" {
        allow_auto_merge                        = false
        allow_forking                           = true
        allow_merge_commit                      = false
      ~ allow_rebase_merge                      = false -> true
      ~ allow_squash_merge                      = false -> true
        allow_update_branch                     = false
        archived                                = false
        auto_init                               = false
        default_branch                          = "main"
      ~ delete_branch_on_merge                  = false -> true
        description                             = "Template repository for ALZ workload repositories with pre-configured Terraform workflows"
        etag                                    = "W/\"2397218167e8db66a5863f314e2208adbb634b50699458c9d11287fe621a35e4\""
        fork                                    = "false"
        full_name                               = "nathlan/alz-workload-template"
        git_clone_url                           = "git://github.com/nathlan/alz-workload-template.git"
        has_discussions                         = false
      - has_downloads                           = true -> null
        has_issues                              = true
      ~ has_projects                            = true -> false
      ~ has_wiki                                = true -> false
        homepage_url                            = null
        html_url                                = "https://github.com/nathlan/alz-workload-template"
        http_clone_url                          = "https://github.com/nathlan/alz-workload-template.git"
        id                                      = "alz-workload-template"
      + ignore_vulnerability_alerts_during_read = false
      ~ is_template                             = false -> true
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
        name                                    = "alz-workload-template"
        node_id                                 = "R_kgDORMl9ZQ"
        primary_language                        = "HCL"
        private                                 = false
        repo_id                                 = 1154055525
        source_owner                            = null
        source_repo                             = null
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
        ssh_clone_url                           = "git@github.com:nathlan/alz-workload-template.git"
        svn_url                                 = "https://github.com/nathlan/alz-workload-template"
      ~ topics                                  = [
          + "alz",
          + "azure",
          + "landing-zone",
          + "template",
          + "terraform",
        ]
        visibility                              = "public"
      + vulnerability_alerts                    = true
        web_commit_signoff_required             = false
    }

  # github_repository.repos["example-repo"] will be created
  + resource "github_repository" "repos" {
      + allow_auto_merge                        = true
      + allow_forking                           = (known after apply)
      + allow_merge_commit                      = true
      + allow_rebase_merge                      = true
      + allow_squash_merge                      = true
      + archived                                = false
      + auto_init                               = true
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = true
      + description                             = "Example repository created with Terraform"
      + etag                                    = (known after apply)
      + fork                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_discussions                         = false
      + has_issues                              = true
      + has_projects                            = true
      + has_wiki                                = true
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "example-repo"
      + node_id                                 = (known after apply)
      + primary_language                        = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + source_owner                            = (known after apply)
      + source_repo                             = (known after apply)
      + squash_merge_commit_message             = "PR_BODY"
      + squash_merge_commit_title               = "PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + topics                                  = [
          + "infrastructure-as-code",
          + "terraform-managed",
        ]
      + visibility                              = "public"
      + vulnerability_alerts                    = true
      + web_commit_signoff_required             = false

      + security_and_analysis (known after apply)
    }

  # github_repository_ruleset.alz_workload_template_main_protection will be created
  + resource "github_repository_ruleset" "alz_workload_template_main_protection" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Protect main branch"
      + node_id     = (known after apply)
      + repository  = "alz-workload-template"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + deletion                      = true
          + non_fast_forward              = true
          + required_linear_history       = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

  # github_repository_ruleset.main_branch_protection["example-repo"] will be created
  + resource "github_repository_ruleset" "main_branch_protection" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Protect main branch"
      + node_id     = (known after apply)
      + repository  = "example-repo"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "refs/heads/main",
                ]
            }
        }

      + rules {
          + deletion                      = true
          + non_fast_forward              = true
          + required_linear_history       = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + allowed_merge_methods             = (known after apply)
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = false
            }
        }
    }

  # github_workflow_repository_permissions.repos["example-repo"] will be created
  + resource "github_workflow_repository_permissions" "repos" {
      + can_approve_pull_request_reviews = true
      + default_workflow_permissions     = "read"
      + id                               = (known after apply)
      + repository                       = "example-repo"
    }

Plan: 1 to import, 6 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + alz_workload_template_is_template = true
  + alz_workload_template_name        = "alz-workload-template"
  + alz_workload_template_url         = "https://github.com/nathlan/alz-workload-template"
  + copilot_firewall_allowlist        = [
      + "registry.terraform.io",
      + "checkpoint-api.hashicorp.com",
      + "api0.prismacloud.io",
    ]
  + organization                      = "nathlan"
  + repositories                      = {
      + example-repo = {
          + branch_protection_id = (known after apply)
          + default_branch       = "main"
          + full_name            = (known after apply)
          + html_url             = (known after apply)
          + http_clone_url       = (known after apply)
          + id                   = (known after apply)
          + name                 = "example-repo"
          + ssh_clone_url        = (known after apply)
        }
    }
  + repository_count                  = 1

```

</details>

*Pusher: @nathanjnorris, Working Directory: `terraform`, Workflow: `CI/CD - Terraform - GitHub Provider`*